{
    "posts":[

        {
            "title":"Example Title 1: Let Her Rip",
            "desc":"Meaning: Permission to start, or it could mean 'go faster!'",
            "link":""
        },

        {
            "title":"Example Title 2: Like Father Like Son",
            "desc":"Meaning: Resembling one's parents in terms of appearance or behavior.",
            "link":""
        },
        {
            "title":"Example Title 3: Go Out On a Limb",
            "desc":"Meaning: Putting yourself in a risky situation in order to help someone; or to hazard a guess.",
            "link":""
        },
        {
            "title":"Example Title 4: Go For Broke",
            "desc":"Meaning: To risk it all, even if it means losing everything. To go all out.",
            "link":""
        },
        {
            "title":"Example Title 5: On Cloud Nine",
            "desc":"Meaning: Having strong feelings of happiness or satisfaction.",
            "link":""
        },
        {
            "title":"Example Title 6: Fit as a Fiddle",
            "desc":"Meaning: Being fit as a fiddle means to be in perfect health.",
            "link":""
        },
        {
            "title":"Example Title 7: Keep Your Shirt On",
            "desc":"Meaning: Keeping calm. Usually said by someone who is trying to avoid making others upset.",
            "link":""
        },
        {
            "title":"Example Title 8: When the Rubber Hits the Road",
            "desc":"Meaning: When something is about to begin, get serious, or put to the test.",
            "link":""
        },
        {
            "title":"Example Title 9: Right Out of the Gate",
            "desc":"Meaning: Right from the beginning; to do something from the start.",
            "link":""
        },
        {
            "title":"Example Title 10: Scot-free",
            "desc":"Meaning: Getting away freely from custody, punishment, or any type of risky situation.",
            "link":""
        },
        {
            "title":"Example Title 11: Dropping Like Flies",
            "desc":"Meaning: To fall down ill or to die in large numbers.",
            "link":""
        },
        {
            "title":"Example Title 12: Up In Arms",
            "desc":"Meaning: Angry; being roused to the point that you are ready to fight.",
            "link":""
        },
        {
            "title":"Example Title 13: Beating a Dead Horse",
            "desc":"Meaning: To bring up an issue that has already been resolved.",
            "link":""
        },
        {
            "title":"Example Title 14: Tug of War",
            "desc":"Meaning: It can refer to the popular rope pulling game or it can mean a struggle for authority.",
            "link":""
        },
        {
            "title":"Example Title 15: There's No I in Team",
            "desc":"Meaning: To not work alone, but rather, together with others in order to achieve a certain goal.",
            "link":""
        },
        {
            "title":"Example Title 16: Wake Up Call",
            "desc":"Meaning: An occurance of sorts that brings a problem to somebody's attention and they realize it needs fixing.",
            "link":""
        },
        {
            "title":"Example Title 17: Hard Pill to Swallow",
            "desc":"Meaning: Something that's difficult to accept.",
            "link":""
        },
        {
            "title":"Example Title 18: Wouldn't Harm a Fly",
            "desc":"Meaning: Nonviolent; someone who is mild or gentle.",
            "link":""
        },
        {
            "title":"Example Title 19: Read 'Em and Weep",
            "desc":"Meaning: Often said by the winner in poker, as the others 'weep' over the loss.",
            "link":""
        },
        {
            "title":"Example Title 20: Yada Yada",
            "desc":"Meaning: A way to notify a person that what they're saying is predictable or boring.",
            "link":""
        },
        {
            "title":"Example Title 21: Between a Rock and a Hard Place",
            "desc":"Meaning: Being faced with two difficult choices.",
            "link":""
        },
        {
            "title":"Example Title 22: Head Over Heels",
            "desc":" Meaning: Falling deeply in love with another person",
            "link":""
        },
        {
            "title":"Example Title 23: Cut The Mustard",
            "desc":"Meaning: To cut the mustard is to meet a required standard, or to meet expectations.",
            "link":""
        },
        {
            "title":"Example Title 24: Don't Look a Gift Horse In The Mouth",
            "desc":"Meaning: When you receive a gift from someone, do not be ungrateful.",
            "link":""
        },
        {
            "title":"Example Title 25: If You Can't Stand the Heat, Get Out of the Kitchen",
            "desc":"Meaning: One should discontinue with a task if they are unable to cope with it due to pressure.",
            "link":""
        },
        {
            "title":"Example Title 26: Short End of the Stick",
            "desc":"Meaning: Getting the bad end of a deal, or receiving the least desirable outcome from something.",
            "link":""
        },
        {
            "title":"Example Title 27: Cut To The Chase",
            "desc":"Meaning: To get to the point, leaving out all of the unnecessary details.",
            "link":""
        },
        {
            "title":"Example Title 28: Roll With the Punches",
            "desc":"Meaning: To tolerate or endure through the unexpected mishappenings you may encounter from time to time.",
            "link":""
        },
        {
            "title":"Example Title 29: Par For the Course",
            "desc":"Meaning: What you would expect to happen; something normal or common.",
            "link":""
        },
        {
            "title":"Example Title 30: Right Off the Bat",
            "desc":"Meaning: Immediately, done in a hurry; without delay.",
            "link":""
        },
        {
            "title":"Example Title 31: Jaws of Life",
            "desc":"Meaning: Usually this references a tool used by rescuers when they pry or cut open a car to save the occupant.",
            "link":""
        },
        {
            "title":"Example Title 32: Lovey Dovey",
            "desc":"Meaning: The affectionate stuff that people do when they are in love, such as kissing and hugging.",
            "link":""
        },
        {
            "title":"Example Title 33: Foaming At The Mouth",
            "desc":"Meaning: To be enraged and show it.",
            "link":""
        },
        {
            "title":"Example Title 34: Hands Down",
            "desc":"Meaning: Anything that's easy or has no difficulty; something that is a certainty.",
            "link":""
        },
        {
            "title":"Example Title 35: Curiosity Killed The Cat",
            "desc":"Meaning: Typically said to indicate that any further investigation into a situation may lead to harm.",
            "link":""
        }

    ]
}